airfoil_naca23012/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

Ux 15.0;
Uy 0.0;

internalField   uniform ($Ux $Uy 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    farfield
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }
    airfoil
    {
        type            noSlip;
    }
}

// ************************************************************************* //
