airfoil_naca23012/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          139008;
        startFace       138503;
    }
    farfield
    {
        type            patch;
        nFaces          799;
        startFace       277511;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          211;
        startFace       278310;
    }
)

// ************************************************************************* //
