airfoil_naca23012/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.87488589251 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.87488589251 10.0 0)
    (21.0 10.0 0)
    (21.0 -0.33795620438 0)
    (21.0 -0.43795620438 0)
    (21.0 -0.53795620438 0)
    (1.01596888439 0.0987167398737 0)
    (1.0 0.0 0)
    (1.01161392957 -0.0993232935411 0)
    (0.248338494807 0.175934427327 0)
    (0.25 0.075948231277 0)
    (0.25 -0.0428758022308 0)
    (0.251661505193 -0.142861998281 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.87488589251 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.87488589251 10.0 1)
    (21.0 10.0 1)
    (21.0 -0.33795620438 1)
    (21.0 -0.43795620438 1)
    (21.0 -0.53795620438 1)
    (1.01596888439 0.0987167398737 1)
    (1.0 0.0 1)
    (1.01161392957 -0.0993232935411 1)
    (0.248338494807 0.175934427327 1)
    (0.25 0.075948231277 1)
    (0.25 -0.0428758022308 1)
    (0.251661505193 -0.142861998281 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (166 91 1) simpleGrading (21.2675030788 55.8970262327 55.8970262327 21.2675030788 0.0121628138855 0.0121628138855 0.0121628138855 0.0121628138855 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (70 91 1) simpleGrading (0.600903122176 2.24686813616 2.24686813616 0.600903122176 0.0123023668552 0.0121628138855 0.0121628138855 0.0123023668552 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 91 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.0121628138855 0.0123023668552 0.0123023668552 0.0121628138855 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (91 31 1) edgeGrading (0.0121628138855 0.0123556277124 0.0123556277124 0.0121628138855 0.0125 0.5 0.5 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (79 91 1) edgeGrading (1.23020056753 0.600903122176 0.600903122176 1.23020056753 80.9347791371 82.2178164864 82.2178164864 80.9347791371 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (166 91 1) simpleGrading (55.8970262327 21.2675030788 21.2675030788 55.8970262327 82.2178164864 82.2178164864 82.2178164864 82.2178164864 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (166 37 1) simpleGrading (55.8970262327 6.08140694277 1) 
    hex (15 12 11 14 34 31 30 33) (79 37 1) egeeGrading (0.8 1.23020056753 1.23020056753 0.8 6.08140694277 6.08140694277 6.08140694277 6.08140694277 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 37 1) edgeGrading (2.0 0.5 0.5 2.0 6.08140694277 6.08140694277 6.08140694277 6.08140694277 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 37 1) edgeGrading (0.5 2.0 2.0 0.5 0.164435632973 0.164435632973 0.164435632973 0.164435632973 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (70 37 1) edgeGrading (2.24686813616 0.8 0.8 2.24686813616 0.164435632973 0.164435632973 0.164435632973 0.164435632973 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (166 37 1) simpleGrading (55.8970262327 0.164435632973 1) 
);

edges
(
    polyLine 11 14
    (
        (1.01326888439 0.100416739874 0)
        (1.00499591235 0.101754948441 0)
        (0.991268771482 0.103949574397 0)
        (0.972268835058 0.1069365985 0)
        (0.948228968608 0.110630272681 0)
        (0.919400543432 0.114951328472 0)
        (0.886090280774 0.119788069026 0)
        (0.848689990758 0.125036762095 0)
        (0.807593207844 0.130587812888 0)
        (0.763222436137 0.1363328449 0)
        (0.71606931965 0.142139506958 0)
        (0.666627927054 0.147908798486 0)
        (0.615386882139 0.153504915056 0)
        (0.56286440225 0.158786351766 0)
        (0.509637279317 0.163610881073 0)
        (0.456202549641 0.167848108192 0)
        (0.403105386978 0.171333085224 0)
        (0.350872257455 0.173937456255 0)
        (0.300001459289 0.175519160048 0)
        (0.250978802876 0.175969451541 0)
    )
    polyLine 30 33
    (
        (1.01326888439 0.100416739874 1)
        (1.00499591235 0.101754948441 1)
        (0.991268771482 0.103949574397 1)
        (0.972268835058 0.1069365985 1)
        (0.948228968608 0.110630272681 1)
        (0.919400543432 0.114951328472 1)
        (0.886090280774 0.119788069026 1)
        (0.848689990758 0.125036762095 1)
        (0.807593207844 0.130587812888 1)
        (0.763222436137 0.1363328449 1)
        (0.71606931965 0.142139506958 1)
        (0.666627927054 0.147908798486 1)
        (0.615386882139 0.153504915056 1)
        (0.56286440225 0.158786351766 1)
        (0.509637279317 0.163610881073 1)
        (0.456202549641 0.167848108192 1)
        (0.403105386978 0.171333085224 1)
        (0.350872257455 0.173937456255 1)
        (0.300001459289 0.175519160048 1)
        (0.250978802876 0.175969451541 1)
    )
    polyLine 14 18
    (
        (0.204133207933 0.175187277808 0)
        (0.15845511777 0.172911932895 0)
        (0.113157191011 0.168141993825 0)
        (0.0694417792388 0.160002461415 0)
        (0.028750678757 0.148119982914 0)
        (-0.00802854171451 0.132376543045 0)
        (-0.0408095103167 0.112162528772 0)
        (-0.0705421279597 0.0843184399664 0)
        (-0.095383018948 0.0391140570933 0)
        (-0.0999876928765 0.0015688445535 0)
    )
    polyLine 33 37
    (
        (0.204133207933 0.175187277808 1)
        (0.15845511777 0.172911932895 1)
        (0.113157191011 0.168141993825 1)
        (0.0694417792388 0.160002461415 1)
        (0.028750678757 0.148119982914 1)
        (-0.00802854171451 0.132376543045 1)
        (-0.0408095103167 0.112162528772 1)
        (-0.0705421279597 0.0843184399664 1)
        (-0.095383018948 0.0391140570933 1)
        (-0.0999876928765 0.0015688445535 1)
    )
    polyLine 18 17
    (
        (-0.0457859188745 -0.0938686057922 0)
        (-0.0240792379026 -0.105813801303 0)
        (0.00583266575234 -0.115663079579 0)
        (0.0322115965089 -0.121035012491 0)
        (0.058466354878 -0.124946786779 0)
        (0.0866818717974 -0.128497615401 0)
        (0.118452326313 -0.132203416586 0)
        (0.155127030003 -0.136128148648 0)
        (0.197421367857 -0.139885183228 0)
        (0.243942926277 -0.142717262907 0)
    )
    polyLine 37 36
    (
        (-0.0457859188745 -0.0938686057922 1)
        (-0.0240792379026 -0.105813801303 1)
        (0.00583266575234 -0.115663079579 1)
        (0.0322115965089 -0.121035012491 1)
        (0.058466354878 -0.124946786779 1)
        (0.0866818717974 -0.128497615401 1)
        (0.118452326313 -0.132203416586 1)
        (0.155127030003 -0.136128148648 1)
        (0.197421367857 -0.139885183228 1)
        (0.243942926277 -0.142717262907 1)
    )
    polyLine 17 13
    (
        (0.29293345914 -0.144431756279 0)
        (0.343818011421 -0.145099344819 0)
        (0.396118357855 -0.144810773894 0)
        (0.449323895005 -0.143670120133 0)
        (0.502896567467 -0.141797280933 0)
        (0.556281909505 -0.139319256437 0)
        (0.608982437242 -0.136368486513 0)
        (0.660410772229 -0.133037797318 0)
        (0.710072308194 -0.129468179746 0)
        (0.757429074384 -0.125739043086 0)
        (0.802008093885 -0.121970123975 0)
        (0.843313765497 -0.118231847424 0)
        (0.88091536854 -0.1146449848 0)
        (0.91440452535 -0.111277975765 0)
        (0.943395747768 -0.108236000092 0)
        (0.967566158639 -0.105608000925 0)
        (0.986685186037 -0.103464585176 0)
        (1.00049836605 -0.101877895315 0)
        (1.00883392957 -0.100903293541 0)
    )
    polyLine 36 32
    (
        (0.29293345914 -0.144431756279 1)
        (0.343818011421 -0.145099344819 1)
        (0.396118357855 -0.144810773894 1)
        (0.449323895005 -0.143670120133 1)
        (0.502896567467 -0.141797280933 1)
        (0.556281909505 -0.139319256437 1)
        (0.608982437242 -0.136368486513 1)
        (0.660410772229 -0.133037797318 1)
        (0.710072308194 -0.129468179746 1)
        (0.757429074384 -0.125739043086 1)
        (0.802008093885 -0.121970123975 1)
        (0.843313765497 -0.118231847424 1)
        (0.88091536854 -0.1146449848 1)
        (0.91440452535 -0.111277975765 1)
        (0.943395747768 -0.108236000092 1)
        (0.967566158639 -0.105608000925 1)
        (0.986685186037 -0.103464585176 1)
        (1.00049836605 -0.101877895315 1)
        (1.00883392957 -0.100903293541 1)
    )
    spline 12 15
    (
        (0.9973 0.0017 0)
        (0.98914 0.00302 0)
        (0.97563 0.00518 0)
        (0.95693 0.00812 0)
        (0.93324 0.01176 0)
        (0.90482 0.01602 0)
        (0.87197 0.02079 0)
        (0.83506 0.02597 0)
        (0.79449 0.03145 0)
        (0.7507 0.03712 0)
        (0.70417 0.04285 0)
        (0.65541 0.04854 0)
        (0.60496 0.05405 0)
        (0.55335 0.05924 0)
        (0.50117 0.06397 0)
        (0.44897 0.06811 0)
        (0.39733 0.0715 0)
        (0.34681 0.07402 0)
        (0.29796 0.07554 0)
        (0.25131 0.07597 0)
    )
    spline 31 34
    (
        (0.9973 0.0017 1)
        (0.98914 0.00302 1)
        (0.97563 0.00518 1)
        (0.95693 0.00812 1)
        (0.93324 0.01176 1)
        (0.90482 0.01602 1)
        (0.87197 0.02079 1)
        (0.83506 0.02597 1)
        (0.79449 0.03145 1)
        (0.7507 0.03712 1)
        (0.70417 0.04285 1)
        (0.65541 0.04854 1)
        (0.60496 0.05405 1)
        (0.55335 0.05924 1)
        (0.50117 0.06397 1)
        (0.44897 0.06811 1)
        (0.39733 0.0715 1)
        (0.34681 0.07402 1)
        (0.29796 0.07554 1)
        (0.25131 0.07597 1)
    )
    arc 4 5 (-7.07107250279 7.07106312094 0)
    arc 3 4 (-7.07107250279 -7.07106312094 0)
    arc 23 24 (-7.07107250279 7.07106312094 1)
    arc 22 23 (-7.07107250279 -7.07106312094 1)
    spline 15 0
    (
        (0.20738 0.07524 0)
        (0.16604 0.0732 0)
        (0.12732 0.06915 0)
        (0.0923 0.06265 0)
        (0.06203 0.05382 0)
        (0.0373 0.04324 0)
        (0.01865 0.03176 0)
        (0.00628 0.0203 0)
        (0.00015 0.00956 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.20738 0.07524 1)
        (0.16604 0.0732 1)
        (0.12732 0.06915 1)
        (0.0923 0.06265 1)
        (0.06203 0.05382 1)
        (0.0373 0.04324 1)
        (0.01865 0.03176 1)
        (0.00628 0.0203 1)
        (0.00015 0.00956 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.00533 -0.00792 0)
        (0.01557 -0.01401 0)
        (0.03029 -0.0187 0)
        (0.04915 -0.02248 0)
        (0.07195 -0.02586 0)
        (0.09868 -0.02922 0)
        (0.12954 -0.03282 0)
        (0.16483 -0.0366 0)
        (0.20483 -0.04016 0)
        (0.24869 -0.04283 0)
    )
    spline 19 35
    (
        (0.00533 -0.00792 1)
        (0.01557 -0.01401 1)
        (0.03029 -0.0187 1)
        (0.04915 -0.02248 1)
        (0.07195 -0.02586 1)
        (0.09868 -0.02922 1)
        (0.12954 -0.03282 1)
        (0.16483 -0.0366 1)
        (0.20483 -0.04016 1)
        (0.24869 -0.04283 1)
    )
    spline 16 12
    (
        (0.29531 -0.04446 0)
        (0.34418 -0.0451 0)
        (0.39476 -0.04482 0)
        (0.4465 -0.04371 0)
        (0.49883 -0.04188 0)
        (0.55117 -0.03945 0)
        (0.60296 -0.03655 0)
        (0.6536 -0.03327 0)
        (0.70257 -0.02975 0)
        (0.7493 -0.02607 0)
        (0.7933 -0.02235 0)
        (0.83407 -0.01866 0)
        (0.87118 -0.01512 0)
        (0.9042 -0.0118 0)
        (0.93279 -0.0088 0)
        (0.95661 -0.00621 0)
        (0.97543 -0.0041 0)
        (0.98901 -0.00254 0)
        (0.99722 -0.00158 0)
    )
    spline 35 31
    (
        (0.29531 -0.04446 1)
        (0.34418 -0.0451 1)
        (0.39476 -0.04482 1)
        (0.4465 -0.04371 1)
        (0.49883 -0.04188 1)
        (0.55117 -0.03945 1)
        (0.60296 -0.03655 1)
        (0.6536 -0.03327 1)
        (0.70257 -0.02975 1)
        (0.7493 -0.02607 1)
        (0.7933 -0.02235 1)
        (0.83407 -0.01866 1)
        (0.87118 -0.01512 1)
        (0.9042 -0.0118 1)
        (0.93279 -0.0088 1)
        (0.95661 -0.00621 1)
        (0.97543 -0.0041 1)
        (0.98901 -0.00254 1)
        (0.99722 -0.00158 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
